---
title: os
date: 2020-05-29 10:35:12
tags:
---
# 内存部分
## 地址空间
* 物理地址空间：硬件支持的地址空间。
* 逻辑地址空间：运行中的程序所拥有的内存范围
* 物理地址空间和逻辑地址空间存在映射关系
## 连续内存分配
* 内存分配策略：
	* 首次适配
	* 最佳匹配分配
	* 最差匹配分配
* 内存碎片处理方法
	* 压缩式碎片整理
	* 交换式碎片整理

## 非连续内存分配
* 两种硬件方法
	* 分段
		* 分段技术使得连续的逻辑地址空间映射成不连续的物理地址空间
		* 分段寻址方案
	* 分页
		* 分页地址空间
			* 划分物理内存至固定大小的帧
			* 划分逻辑地址空间至相同大小的页
		* 分页寻址方案
			* 页映射到帧
			* 页是连续的虚拟内存
			* 帧是非连续的物理内存
			* 不是所有的页都有对应的帧
## 页表
* 页表结构
	* 每个运行的程序都有一个页表
* TLB  位于cpu内部，用于缓冲页表
* 多级页表
	* 使用多级页表减少页表查询空间
* 反向表

## 虚拟内存
* 覆盖技术
![a a](/img/os01.png) 
* 交换技术

![a a](/img/os02.png)
![a a](/img/os03.png)
![a a](/img/os04.png)

## 页面置换算法
* 功能：当缺页中断发生，需要调入新的页面而内存已满时，选择内存中哪个物理页面被置换。
* 目标：尽可能减少页面换进换出次数。即把未来不再使用的或短期内较少使用的页面换出。
* 页面锁定：用于描述必须常驻内存的操作系统的关键部分或时间关键的应用进程。

## 最优页面置换算法
* 思路：当一个缺页中断发生，对于保存在内存当中的每一个逻辑页面，计算其下次访问之前，还需等待多长时间，从中选择等待时间最长的作为被置换页面。
* 过于理想，可用于其他算法性能评价依据。

## 先进先出算法
* 思路：选择在内存中驻留时间最长的页面将其淘汰。系统维护着一个链表，记录了所有位于内存当中的逻辑页面，链首页面的驻留时间最长，链尾页面驻留时间最短。当发生缺页中断，将链首页面淘汰，添加新页面至链表末尾。
* 性能较差。
![a a](/img/os05.png)

## 最近最久未使用算法
* 思路：当发生缺页中断，淘汰最久未使用的页面。
* 他是对最优页面置换算法的一个近似，其依据是程序的局部性原理，即在最近一小段时间内（最近几条指令内），若某些页面被频繁访问，那么在将来一小段时间内，他们还可能会再一次被频繁的访问；反之，若某些页面长时间内未被访问，那么他们将来长时间内可能也不会被访问。
![a a](/img/os06.png) 
![a a](/img/os07.png) 
![a a](/img/os08.png) 

## 时钟页面置换算法
* LRU的近似，FIFO的一种改进
* 思路：当一个页面被装入内存，将该页面页表项的访问位初始化为0，若该页面被访问(读/写)，则把改为置为1。
* 把各个页面组成成环形链表，把指针指向最老页面(最先进来)
* 当发生缺页中断，考察指针所指向的最老页面，若它的访问位为0，立即淘汰；若访问位为1，则吧该位置为0，然后指针往下移动一格。如此下去，直到找到被淘汰的页面，然后把指针移动到它的下一格。
![a a](/img/os09.png)
![a a](/img/os10.png)

## 二次机会法
![a a](/img/os11.png)
![a a](/img/os12.png)

## 最不常用算法
* 当缺页中断发生，选择访问次数最后少的那个页面淘汰。
* 对每个页面设置一个访问计数器，当页面被访问时该页面的访问计数器加1.当发生缺页中断时，淘汰计数值最小的那个页面。

## Belady现象
* 在采用FIFO算法时，有时会出现分配的物理页面数增加，缺页率反而提高的异常现象。

## 工作集模型
* 工作集模型用于证明局部性原理成立。
* 工作集：一个进程当前正在使用的逻辑页面集合。
![a a](img/os13.png)
![a a](img/os14.png)
![a a](img/os15.png)

## 常驻集
* 常驻集是指在当前时刻，进程实际驻留在内存当中的页面集合。
![a a](/img/os16.png)

## 抖动问题
* 如果分配给一个进程的物理页面太少，不能包含整个工作集，即常驻集 属于 工作集，那么进程将造成很多缺页中断，需要频繁的在内存和外存之间替换页面，从而使进程的运行速度变得很慢，这种状态称为"抖动"
* d抖动产生原因：随着驻留内存的进程数目增加，分配给每个进程的物理页面不断减小，缺页率不断上升。所以os要选择一个适当的进程数目和进程需要的帧数，以便在并发水平和缺页率之间达到一个平衡。
![a a](img/os17.png)

# 进程
* 进程的定义：一个具有一定独立功能的程序在一个数据集合上的一次动态执行过程。
![a a](/img/os18.png)

## 进程的组成
* 一个进程应该包括：
	* 程序的代码
	* 程序处理的数据
	* 程序计数器中的值，指示下一条将运行的指令
	* 一组通用的寄存器的当前值、堆、栈
	* 一组系统资源（如打开的文件）
	* 总之，进程包含了正在运行的一个程序的所有状态信息
* 进程与程序的联系
	* 程序是产生进程的基础
	* 程序的每次运行构成不同的进程
	* 进程是程序功能的体现
	* 通过多次执行，一个程序可对应多个进程；通过调用关系，一个进程可包括多个程序。
## 进程与程序的区别
* 进程是动态的，程序是静态的；程序是有序代码的集合；进程是程序的执行，进程有核心态/用户态
* 进程是蚕食的，程序是永久的；进程是一个状态变化的过程，程序可永久保存
* 进程与程序的组成不同：进程的组成包括程序、数据和进程控制块(即进程状态信息)
![a a](/img/os19.png)

## 进程的特点
* 动态性：可动态的创建、结束进程；
* 并发性：进程可以被独立调度并占用处理机运行； 
* 独立性：不同进程的工作不相互影响
* 制约性：因访问共享数据/资源或者进程间同步而产生制约

## 进程控制块(PCB)
* 进程控制块，用于描述进程的数据结构
* 操作系统为每个进程都维护了一个pcb，用来保存与该进程有关的各种状态信息。

## 使用进程控制块
* 进程的创建:为该进程生成一个PCB；
* 进程的终止：回收它的PCB；
* 进程的组织管理：通过对PCB的组织管理来实现
## PCB含有以下三大类信息：
* 进程表示信息：如本进程的标示，本进程的产生者标示(父进程标示)，用户标示
* 处理机状态信息保存区：保存进程的运行现场信息。
	* 用户可见寄存器，用户程序可以使用的数据，地址等寄存器
	* 控制和状态寄存器，如程序计数器(PC),程序状态字(psw)
	* 栈指针，过程调用/系统调用/中断处理和返回时需要用到它
* 进程控制信息：
	* 调度和状态信息，用于操作系统调度进程并占用处理机使用。
	* 进程间通信信息，为支持进程间的与通信相关的各种标示、信号、信件等，这些信息存在接收方的进程控制块中。
	* 存储管理信息：包含有指向本进程映像存储空间的数据结构
	* 进程所用资源：说明由进程打开、使用的系统资源，如打开的文件等。
	* 油管数据结构连接信息：进程可以连接到一个进程队列中，或连接到相关的其他进程的PCB
## PCB的组织方式
* 链表：同一状态的进程其pcb成一链表，多个状态对应多个不同的链表。各状态的进程形成不同的链表：就绪链表、阻塞链表
* 索引表：同一状态的进程归入一个index表(由index指向pcb)，多个状态对应多个不同的index表。各状态的进行形成不同的索引表：就绪索引表、阻塞索引表
![a a](/img/os20.png)

## 进程的生命期管理
* 进程的生命期管理：
	* 进程创建
	* 进程运行
	* 进程等待
	* 进程唤醒
	* 进程结束
* 进程创建：	
	* 引起进程创建的3个主要事件
		* 系统初始化时
		* 用户请求创建一个新进程
		* 正在运行的进程执行了创建进程的系统调用
* 进程运行：
	* 内核选择一个就绪的进程，让它占用处理机并执行
* 进程等待：
	* 以下情况，进程等待(阻塞)
		* 请求并等待系统服务，无法马上完成
		* 启动某种操作，无法马上完成
		* 需要的数据没有到达
	* 进程只能自己阻塞自己，因为只有进程自身才能知道何时需要等待某种事件的发生。
* 进程唤醒：
	* 唤醒进程的原因：
		* 被阻塞进程需要的资源可被满足
		* 被阻塞进程等待的事件到达
		* 将该进程的PCB插入到就绪队列
	* 进程只能被别的进程或操作系统唤醒
* 进程结束：
	* 以下情况，进程退出
		* 正常退出
		* 错误退出
		* 致命错误
		* 被其他进程所杀

* 进程状态变化模型
	* 进程的三种基本状态：（进程在生命结束前处于且仅处于三种基本状态之一）
		* 运行状态：当一个进程正在处理机上运行时。
		* 就绪状态：一个进程获得了除处理机之外的一切所需资源，一旦得到处理机即可运行。
		* 等待（阻塞）状态：一个进程正在等待某一个事件儿暂时运行。如等待某资源，等待输入、输出完成。
	* 进程其他的基本状态：
		* 创建状态：一个进程正在被创建，还没有转到就绪状态之前的状态
		* 结束状态：一个进程正在从系统中消失时的状态，这是因为进程结束或由于其他原因所导致。
![a a](/img/os21.png)

* 可能的状态变化如下
	* NULL -> New:一个新进程被产生出来执行一个程序。
	* New -> Ready:当基础被创建完成并初始化后，一切就绪准备运行时，变为就绪状态。
	* Ready -> Running:处于就绪状态的进程被进程调度程序选中后，就分配到处理机上来运行。
	* Running -> Exit:当进程表示他已经完成或者因出错，当前运行进程会由操作系统作结束处理。
	* Running -> Ready:处于运行状态的进程在其运行过程中，由于分配给他的处理机时间片用完而让出处理机。
	* Running -> Blocked:当进程请求某样东西且必须等待时。
	* Blocked -> Ready:当进程要等待的某事件到来时，他从阻塞状态变为就绪状态。

## 进程挂起
	* 作用：合理且充分的利用系统资源
	* 进程在挂起状态时,意味着进程没有占用内存空间.处在挂起状态的进程映像在磁盘上.
## 挂起状态
	* 阻塞挂起状态:进程在外存并等待某事件的出现
	* 就绪挂起状态:进程在外存,但只要进入内存,即可运行
![a a](/img/os22.png)
![a a](/img/os23.png)

## 状态队列
	* 由操作系统来维护一组队列,用来表示系统当中所有进程的当前状态
	* 不同的状态分别用不用的队列来表示(就绪队列,各种类型的阻塞队列)
	* 每个进程的PCB都根据他的状态加入到相应的队列当中,当一个进程的状态发生变化时,他的PCB从一个状态队列脱离出来,加入到另外一个队列.

# 线程
* 自从60年代提出进程概念以来,在操作系统中一直都是以进程作为独立运行的基本单位,直到80年代中期,提出了更小的能够独立运行的基本单位----线程
![a a](/img/os24.png) 
![a a](/img/os25.png)
![a a](/img/os26.png)
![a a](/img/os27.png)

## 什么是线程
* 进程当中的一条执行流程
* 从两个方面来重新理解进程 
	* 从资源组合的角度:进程把一组相关的资源组合起来,构成了一个资源平台,包括地址空间(代码段,数据段),打开的文件等各种资源.
	* 从运行的角度:代码在这个资源平台上的一条执行流程(线程)
* 线程 = 进程 - 共享资源
	* 线程的优点:
		* 一个进程中可以同时存在多个线程
		* 各个线程之间可以并发执行
		* 各个线程之间可以共享地址空间和文件等资源
	* 线程的缺点:
		* 一个线程崩溃,会导致其所属进程的所有线程崩溃

## 线程的实现
* 三种线程实现方式:
	* 用户线程:在用户空间实现:
	* 内核线程:在内核中实现
	* 轻量级线程:在内核中实现,支持用户线程
* 用户线程与内核线程的三种对于关系
	* 多对一
	* 一对一
	* 多对多
![a a](/img/os28.png)
![a a](/img/os29.png)
* 用户线程缺点:
	* 阻塞性的系统调用如何实现?如果一个线程发起系统调用而阻塞,则整个进程在等待;
	* 当一个线程开始运行后,除非它主动交出cpu的使用权,否则它所在的进程当中的其他线程将无法运行;
	* 由于时间片分配给进程,故与其他进程比,在多线程执行时,每个线程得到的时间片较少,执行会较慢
![a a](/img/os30.png)
![a a](/img/os31.png)
![a a](/img/os32.png)

## 上下文切换
* 停止当前运行进程(从运行状态改变成其他状态),并且调度其他进程(转变成运行状态)
	* 必须在切换之前存储许多部分的进程上下文
	* 必须能够在之后恢复他们,所以进程不能显示他曾经被暂停过
	* 必须快速(上下文转换是非常频繁的)
* 需要存储什么上下文?
	* 寄存器(pc,sp,...),cpu状态
	* 一些时候可能会费时,所以我们应该尽可能避免
![a a](/img/os33.png)
* 操作系统为活跃进程准备了进程控制块(pcb)
* 操作系统将进程控制块(pcb)放置在一个合适的队列里
	* 就绪队列
	* 等待I/O队列(每个设备的队列)
	* 僵尸队列
## 进程的创建	 
![a a](/img/os34.png)
![a a](/img/os35.png)
![a a](/img/os36.png)
![a a](/img/os37_1.png)
![a a](/img/os37.png)
![a a](/img/os38.png)
![a a](/img/os39.png)
![a a](/img/os40.png)
![a a](/img/os41.png)
* wait()系统调用是被父进程用来等待子进程的结束
	* 一个子进程向父进程返回一个值,所以父进程必须接受这个值并处理
	* wait()系统调用担任这个要求	
		* 它使父进程去睡眠来等待子进程的结果
		* 当一个子进程调用eixt()时候,操作系统解锁父进程,并且将通过exit()传递得到的返回值作为wait调用的一个结果(连通子进程pid一起)如果这没有子进程存活,wait()立刻返回.
		* 当然,如果这里有为父进程的僵尸等待,wait()立即返回其中一个值(并且解除僵尸状态)
* 进程结束执行之后,它调用exit()
* 这个系统调用:
	* 将这程序的"结果"作为一个参数
	* 关闭所有打开的文件,连接等等
	* 释放内存 
	* 释放大部分支持进程的操作系统结构
	* 检查是否父进程是存活着的
		* 若是,他保留结果的值直到父进程需要他,在这种情况,进程没有真正死亡,而是进入僵尸状态
		* 如果其父进程没有存活,子进程释放所有数据结构,这个子进程死亡
	* 清理所有等待的僵尸进程
* 进程终止是最终的垃圾收集(资源回收)
![a a](/img/os42.png)

## 调度
* cpu调度
	* 从就绪队列中挑选一个进程/线程作为CPU将要运行的下一个进程/线程
	* 调度程序:挑选进程/线程的内核函数(通过一些调度策略)
	* 什么时候进行调度?
* 内核运行调度程序的条件(满足一条即可)
	* 一个进程从运行状态切换到等待状态
	* 一个进程被终结了
* 不可抢占
	* 调度程序必须等待事件结束
* 可以抢占
	* 调度程序在中断被相应后执行
	* 当前的进程从运行切换到就绪,或者一个进程从等待切换到就绪
	* 当前运行的进程可以被换出
* 调度算法
![a a](/img/os43.png)
![a a](/img/os44.png)
![a a](/img/os45.png)
![a a](/img/os46.png)
![a a](/img/os47.png)
![a a](/img/os48.png)
![a a](/img/os49.png)
![a a](/img/os50.png)

# 临界区

## 几个概念
* 临界区
	* 临界区是指进程中的一段需要访问共享资源并且当另一个进程处于相应代码区域时便不会被执行的代码区域。
* 互斥
	* 当一个进程处于临界区并访问共享资源时，没有其他进程处于临界区并且访问任何相同的共享资源。
* 死锁
	* 两个或以上的进程，在相互等待完成特定任务，而最终没法将自身任务进行下去。
* 饥饿
	* 一个可执行的进程，被调度器持续忽略，以至于虽然处于可执行状态却不被执行。

![a a](/img/os51.png)

* 互斥：同一时间临界区中最多存在一个线程
* Progress:如果一个线程想要进入临界区，那么他最终会成功
* 有限等待：如果一个线程i处于入口区，那么在i的请求被接受之前，其他线程进入临界区的时间是有限制的
* 无忙等待(可选)：如果一个进程在等待进入临界区，那么在它可以进入之前会被挂起。

## 进入临界区和离开临界区三个方法
* 禁用硬件中断
	* 没有中断，没有上下文切换，因此没有并发
		* 硬件将中断处理延迟到中断被启用之后
		* 大多数现代计算机体系结构都提供指令来完成
	* 进入临界区
		* 禁用中断
	* 离开临界区
		* 开启中断
	* 一旦中断被禁用，线程就无法被停止
		* 整个系统都会为你停下来
		* 可能导致其他线程处于饥饿状态
	* 要是临界区可以任意长怎么办
		* 无法限制相应中断所需的时间(可能存在硬件影响)_
* 基于软件的解决方法
![a a](/img/os52.png)
![a a](/img/os53.png)

* 更高级的抽象方法
	* 硬件提供了一些原语
		* 像中断禁用，原子操作指令
		* 大带哦书现代体系结构都这样
	* 操作系统提供更高级的编程抽象来简化并行编程
		* 例如：锁，信号量
		* 从硬件原语中构建
## 信号量的使用
	* 信号量是整数
	* 信号量是被保护的变量
		* 初始化完成后，唯一改变一个信号的值的办法是通过P()和V()
		* 操作必须是原子
	* P()能够阻塞，V()不会阻塞
	* 我们假定信号量是“公平的”
		* 没有线程被阻塞在P()仍然堵塞如V	* 信号量是整数
	* 信号量是被保护的变量
		* 初始化完成后，唯一改变一个信号的值的办法是通过P()和V()
		* 操作必须是原子
	* P()能够阻塞，V()不会阻塞
	* 我们假定信号量是“公平的”
		* 没有线程被阻塞在P()仍然堵塞如果v()被无限频繁调用(在同一个信号量)
* 两种类型信号量
	* 二进制信号量：可以是0或者1
	* 一般/计数信号量：可以取任何非负值
	* 二者相互表现(给定一个可以实现另一个)
* 信号量可以用在2个方面
	* 互斥
	* 条件同步(调度约束---一个线程等待另一个线程的事情发生)
## 管程
* 目的：分离互斥和条件同步的关注
* 什么是管程
	* 一个锁：指定临界区
	* 0或者多个条件变量：等待/通知信号量用于管理并发访问共享数据
* 一般方法
	* 收集在对象/模块中的相关共享数据
	* 定义方法来访问共享数据



